app/views/comments/_review.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 13 LIMIT 1
---
<% @comments.each do |comment| %>
<% @user = User.find_by_id(comment.user_id)%>