app/views/courses/course_payment.html.erb

             :phone =>  "9893171496" %>
  <%  service.redirect :return_url => confirm_course_payment_course_url(Course.first) %>
---
SELECT "courses".* FROM "courses" ORDER BY courses.created_at DESC LIMIT 1