app/views/courses/edit.html.erb

SELECT "topics".* FROM "topics" ORDER BY name
---
<%= f.label :topic_ids, "Topics" %>
<%= f.collection_select :topic_ids, Topic.order(:name), :id, :name, {}, {multiple: true} %>