app/controllers/authentication_controller.rb

  def create
    auth = request.env["omniauth.auth"]

    # Try to find authentication first
    authentication = Authentication.find_by_provider_and_uid(auth['provider'], auth['uid'])

    if authentication
      # Authentication found, sign the user in.
      flash[:info] = "Welcome. #{authentication.user.name}"
      sign_in_and_redirect(:user, authentication.user)

      #login_and_redirect_user(authentication.user)
    else
      # Authentication not found, thus a new user.
      email=auth['info']['email']
      check_user=User.find_by_email(email)

      if check_user
        flash[:error] = "Email id #{email} Already Registered using #{check_user.provider.capitalize}"
        redirect_to root_url
      else
        user = User.new
        user.apply_omniauth(auth)
        if user.save(:validate => false)
---
SELECT "authentications".* FROM "authentications" WHERE "authentications"."provider" = 'facebook' AND "authentications"."uid" = '1237754790' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."email" = 'samuels410@gmail.com' LIMIT 1
INSERT INTO "authentications" ("created_at", "provider", "token", "uid", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)
INSERT INTO "users" ("created_at", "current_sign_in_at", "current_sign_in_ip", "email", "encrypted_password", "image", "last_sign_in_at", "last_sign_in_ip", "name", "phone", "provider", "remember_created_at", "reset_password_sent_at", "reset_password_token", "sign_in_count", "sub_plan", "updated_at", "user_desc", "user_type", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "users" SET "last_sign_in_at" = '2013-03-16 09:55:11.422517', "current_sign_in_at" = '2013-03-16 09:55:11.422517', "last_sign_in_ip" = '127.0.0.1', "current_sign_in_ip" = '127.0.0.1', "sign_in_count" = 1, "updated_at" = '2013-03-16 09:55:11.425056' WHERE "users"."id" = 13