app/controllers/comments_controller.rb

	def create
		@comment = @commentable.comments.build(params[:comment])
		@comment.user_id = current_user.id
		respond_to do |format|
			if @comment.save
---
INSERT INTO "comments" ("comment", "commentable_id", "commentable_type", "created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)

	def load_commentable
		debugger
		@commentable = params[:commentable_type].camelize.constantize.find(params[:commentable_id])
		@comments = @commentable.comments.recent.limit(10).all
---
SELECT "comments".* FROM "comments" WHERE "comments"."commentable_id" = 10 AND "comments"."commentable_type" = 'Course' ORDER BY created_at DESC LIMIT 10