app/controllers/courses_controller.rb

	def index
		@countCoursesPerPage = 5
       @courses = Course.where(ispublished: 1).paginate(page: params[:page], per_page: 5)
		@topics = Topic.order(:name)
---
SELECT "courses".* FROM "courses" WHERE "courses"."ispublished" = 1 ORDER BY courses.created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "courses" WHERE "courses"."ispublished" = 1
SELECT "topics".* FROM "topics" ORDER BY name

	def edit
    	@course = Course.find(params[:id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? ORDER BY courses.created_at DESC LIMIT 1  [["id", "7"]]

	def show
		@course = Course.find(params[:id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? ORDER BY courses.created_at DESC LIMIT 1  [["id", "10"]]

	def show
		@course = Course.find(params[:id])

		@countCommentsPerPage = 5
		@comments = @course.comments.paginate(page: params[:page], per_page: 5)
		@count = @course.comments.count
		if signed_in?
			unless RatingCache.find_by_cacheable_id(@course.id) == nil
				@qty = RatingCache.find_by_cacheable_id(@course.id).qty
			end

			@rated = Rate.find_by_rater_id(current_user.id)
---
SELECT "rates".* FROM "rates" WHERE "rates"."rater_id" = 13 LIMIT 1

	def destroy
	    @course = Course.find(params[:id])
	    @course.destroy
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? ORDER BY courses.created_at DESC LIMIT 1  [["id", "4"]]
DELETE FROM "courses" WHERE "courses"."id" = ?  [["id", 4]]