app/controllers/registrations_controller.rb


    #LMS User Creation
    lmsuser=CanvasREST::User.new
    u=lmsuser.create_user(Settings.lms.account_id,current_user.name,current_user.email,current_user.password)
    current_user.update_attributes(:lms_id => u["id"])
---
INSERT INTO "users" ("created_at", "current_sign_in_at", "current_sign_in_ip", "email", "encrypted_password", "image", "last_sign_in_at", "last_sign_in_ip", "lms_id", "name", "phone", "provider", "remember_created_at", "reset_password_sent_at", "reset_password_token", "sign_in_count", "sub_plan", "updated_at", "user_desc", "user_type", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "users" SET "last_sign_in_at" = '2013-03-18 11:17:11.262248', "current_sign_in_at" = '2013-03-18 11:17:11.262248', "last_sign_in_ip" = '127.0.0.1', "current_sign_in_ip" = '127.0.0.1', "sign_in_count" = 1, "updated_at" = '2013-03-18 11:17:11.263441' WHERE "users"."id" = 28